atuin
bat
eza
fd
fnm
fzf
gh
ghz
git-lfs
go
gopls
grpcurl
hadolint
htop
jqp
lazygit
neovim
ollama
pipx
python@3.13
ripgrep
tlrc
tmux
yazi
zoxide
drawio
ghostty
spellcheck
starship
