act
agg
asciinema
atuin
awscli
bat
cirrus
codex
eza
fd
fnm
fzf
gh
ghz
gifsicle
git-lfs
go
gopls
grpcurl
hadolint
htop
jqp
k6
lazygit
mdless
ncdu
neovim
nushell
ollama
openjdk
pandoc
pipx
poppler
python@3.13
ripgrep
rust
shellcheck
sshpass
starship
tart
telnet
thefuck
tlrc
tmux
tree
viu
yazi
zoxide
cap
drawio
ghostty
mactex
oracle-jdk
postman
